DataProcessors/Enums/ТипыИнформацииБазыЗнаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыИнформацииБазыЗнаний</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ссылка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Идея</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Учёба</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заметка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/Enums/ТипыНапоминаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыНапоминаний</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>За15Минут</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаЧас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаДень</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовыйПароль</Name>
					<Comment>Используется только для ввода нового пароля</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелеграмID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходРазрешен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Роли</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяРоли</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/CommonModules/ТгБотСервисы/Ext/Module.bsl
// Извлекает имя тега из текста, содержащего символ #.
//
// Параметры:
//   ТекстСТегом - Строка - Текст с тегом, содержащим символ #
//
// Возвращаемое значение:
//   Строка - Имя тега в верхнем регистре
Функция ОпределитьИмяТегаПоТексту(ТекстСТегом) Экспорт
    ПозТега = Найти(ТекстСТегом, "#");
    СтрокаПослеРешетки = СокрЛП(Сред(ТекстСТегом, ПозТега + 1));
    ПозПробела = Найти(СтрокаПослеРешетки, " ");
    ИмяТега = ВРег(?(ПозПробела > 0, Лев(СтрокаПослеРешетки, ПозПробела - 1), СтрокаПослеРешетки));
    Возврат ИмяТега;
КонецФункции
//Функция по определению типа тэга
Функция ОпределитьТипИнформацииПоТексту(ИмяТега) Экспорт
    
    Если ИмяТега = "УЧЕБА" Тогда
        Возврат Перечисления.ТипыИнформацииБазыЗнаний.Учеба;
    ИначеЕсли ИмяТега = "ИДЕЯ" Тогда
        Возврат Перечисления.ТипыИнформацииБазыЗнаний.Идея;
    ИначеЕсли ИмяТега = "ССЫЛКА"  Тогда
        Возврат Перечисления.ТипыИнформацииБазыЗнаний.Ссылка;
    Иначе
        Возврат Перечисления.ТипыИнформацииБазыЗнаний.Заметка;
    КонецЕсли;
    
КонецФункции
//Определить пользователя по айди
Функция ОпределитьПользователяПоID(АвторID) Экспорт
	  Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Пользователи.Ссылка КАК Пользователь
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.ТелеграмID = &ТелеграмID
	|	И Пользователи.ВходРазрешен = ИСТИНА";
	Запрос.УстановитьПараметр("ТелеграмID", Формат(АвторID, "ЧГ=0"));
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Пользователь;
	КонецЕсли;
	Возврат Справочники.Пользователи.ПустаяСсылка();
КонецФункции 
//Определить айди по пользователю
Функция ОпределитьIDПоПользователю(ТекПользователь) Экспорт
	Если НЕ ЗначениеЗаполнено(ТекПользователь) Тогда
		Возврат 0;
	КонецЕсли;
	ТелеграмID = ТекПользователь.ТелеграмID;
	Если ПустаяСтрока(ТелеграмID) Тогда
		Возврат 0;
	КонецЕсли;
	Возврат Число(ТелеграмID);
КонецФункции
//Функция помощник календарь
Функция ПолучитьСекундыИзТипаНапоминания(Тип)  Экспорт
	Если Тип = Перечисления.ТипыНапоминаний.За15Минут Тогда Возврат СекундыВ15Минутах();
    ИначеЕсли Тип = Перечисления.ТипыНапоминаний.ЗаЧас Тогда Возврат СекундыВЧасе();
    ИначеЕсли Тип = Перечисления.ТипыНапоминаний.ЗаДень Тогда Возврат СекундыВДне();
    КонецЕсли;
    Возврат 0;
КонецФункции

#Область Константы
// Возвращает количество секунд в сутках.
//
// Возвращаемое значение:
//   Число - количество секунд в сутках (86400)
// Возвращает количество секунд в часе.
//
// Возвращаемое значение:
//   Число - количество секунд в часе (3600)
// Возвращает количество секунд в 15 минутах.
//
// Возвращаемое значение:
//   Число - количество секунд в 15 минутах (900)
// Возвращает значение таймаута для API Telegram.
//
// Возвращаемое значение:
//   Число - таймаут в секундах
// Возвращает значение таймаута для HTTP-соединения.
//
// Возвращаемое значение:
//   Число - таймаут в секундах
Функция СекундыВДне() Экспорт
	Возврат 86400;
КонецФункции
Функция СекундыВЧасе() Экспорт
	Возврат 3600;
КонецФункции
Функция СекундыВ15Минутах() Экспорт
	Возврат 900;
КонецФункции
Функция ТаймаутТелеграмAPI() Экспорт
	Возврат 50;
КонецФункции
Функция ТаймаутHTTPСоединения() Экспорт
	Возврат 60;
КонецФункции
#КонецОбласти
